Documents/ТК_ТТН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ТК_ТТН</Name>
			<BasedOn>
				<xr:Item>Document.ТК_НалоговаяНакладная</xr:Item>
				<xr:Item>Document.РеализацияТоваров</xr:Item>
				<xr:Item>Document.ВыпускПродукции</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыТТН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктОтправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктПолучатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автотранспорт</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автотранспорт</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пломба</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьОтветственногоОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьОтветственногоПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПрав</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьДанныеЛогистики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Источники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
								<v8:Type>cfg:DocumentRef.РезервированиеЗаказовПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ТК_НалоговаяНакладная</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Масса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отгрузка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусыТТН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыТТН</Name>
			<Comment>Статус документа ТТН</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КИсполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ТК_ТТН/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ТекущаяСтрокаИсточники;


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ГруппыДляРазмещения = Новый СписокЗначений;
	ГруппыДляРазмещения.Добавить(УправлениеСвойствами.НаборСвойствПоИмени("Документ_ТК_ТТН_Логистика"), Элементы.ГруппаЛогистика.Имя);
	ГруппыДляРазмещения.Добавить("ВсеОстальные", Элементы.ГруппаДополнительныеРеквизиты.Имя);
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", ГруппыДляРазмещения);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства	
	
	УстановитьДоступностьЭлементов();
	
	НеделиДень = ДеньНедели(Объект.Дата);
	ДатаПечати = ?(НеделиДень>4,Объект.Дата+(8-НеделиДень)*86400,Объект.Дата+86400);
	
	Элементы.ФормаДокументТК_ТТНПакетДокументов.Видимость = ПросмотрПечати;
	Элементы.ФормаДокументТК_ТТНПакетДокументовНаПринтер.Видимость = НЕ ПросмотрПечати;
	Элементы.ГруппаДатаПечати.Видимость = ПросмотрПечати;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства		
	
	Документы.ТК_ТТН.ЗаполнитьРеквизитыТабличнойЧасти(Объект.Источники);
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Документы.ТК_ТТН.ЗаполнитьРеквизитыТабличнойЧасти(Объект.Источники);
	
	УстановитьСостояниеДокумента();
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаСервереБезКонтекста
Функция АвтомобильПриИзмененииНаСервере(Автомобиль)
	Возврат Автомобиль.Водитель;
КонецФункции

&НаКлиенте
Процедура АвтомобильПриИзменении(Элемент)
	Если ТипЗнч(Объект.Автомобиль) = Тип("СправочникСсылка.Автотранспорт") Тогда
		Объект.Водитель = АвтомобильПриИзмененииНаСервере(Объект.Автомобиль);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЕстьДанныеЛогистикиПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
	
	// СтандартныеПодсистемы.Свойства
	ОбновитьЭлементыДополнительныхРеквизитов();
	// Конец СтандартныеПодсистемы.Свойства	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыИсточники

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Документ.РеализацияТоваров.Форма.ФормаВыбора" Тогда
		ОбработатьВыбранноеЗначение(ВыбранноеЗначение);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.ПеремещениеТоваров.Форма.ФормаВыбора" Тогда	
		ОбработатьВыбранноеЗначение(ВыбранноеЗначение);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.РезервированиеЗаказовПокупателя.Форма.ФормаВыбора" Тогда 
		ОбработатьВыбранноеЗначение(ВыбранноеЗначение);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.ТК_НалоговаяНакладная.Форма.ФормаВыбора" Тогда
		ОбработатьВыбранноеЗначение(ВыбранноеЗначение);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.ВыпускПродукции.Форма.ФормаВыбора" Тогда 
		ОбработатьВыбранноеЗначение(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыбранноеЗначение(ВыбранноеЗначение)
	
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		СтруктураТекСтрока = Новый Структура("НомерСтроки,Документ,Масса,Отгрузка,Маршрут,Автор,ТочкаДоставки,Контрагент,Регламент");
		
		Для Каждого ЭлементМассива Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.Источники.Добавить();
			НоваяСтрока.Документ = ЭлементМассива;
			
			ЗаполнитьЗначенияСвойств(СтруктураТекСтрока,НоваяСтрока);
			ОбработкаРеквизитовТЧ(СтруктураТекСтрока);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если Элемент.ТекущийЭлемент.Имя = "ИсточникиДокумент" И НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Документ) Тогда
		Элемент.ТекущиеДанные.СтатусДокумента = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсточникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.СтатусДокумента = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсточникиДокументПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Источники.ТекущиеДанные;
	
	
	
	СтруктураТекСтрока = Новый Структура("НомерСтроки,Документ,Масса,Отгрузка,Маршрут,Автор,ТочкаДоставки,Контрагент,Регламент");
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.Документ) Тогда
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока,СтруктураТекСтрока,,"НомерСтроки,Документ");
	Иначе	
		ЗаполнитьЗначенияСвойств(СтруктураТекСтрока,ТекущаяСтрока);
		ОбработкаРеквизитовТЧ(СтруктураТекСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИсточникиПриАктивизацииСтрокиНаСервере(МассивДок)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(РезервированиеЗаказовПокупателяТовары.Количество * РезервированиеЗаказовПокупателяТовары.Коэффициент) КАК Количество
	|ИЗ
	|	Документ.РезервированиеЗаказовПокупателя.Товары КАК РезервированиеЗаказовПокупателяТовары
	|ГДЕ
	|	РезервированиеЗаказовПокупателяТовары.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивДок);
	
	РезультатЗапроса = Запрос.Выполнить();		//	Запрос.Выполнить().Выгрузить()
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Формат(Выборка.Количество,"ЧДЦ=2; ЧН=-");
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	Возврат Формат(0,"ЧДЦ=2; ЧН=-");
КонецФункции

&НаКлиенте
Процедура ИсточникиПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущаяСтрока <> Неопределено И Элемент.ТекущаяСтрока <> ТекущаяСтрокаИсточники Тогда
		ТекущаяСтрокаИсточники = Элемент.ТекущаяСтрока;
		МассивСтрок = Элементы.Источники.ВыделенныеСтроки;
		
		Если МассивСтрок.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		МассивРез = Новый Массив;
		для Каждого  СтрЗаказ Из МассивСтрок Цикл
			МассивРез.Добавить(Объект.Источники.НайтиПоИдентификатору(СтрЗаказ).Документ);	
		КонецЦикла;
		
		Элементы.ИсточникиДокумент.ТекстПодвала = ИсточникиПриАктивизацииСтрокиНаСервере(МассивРез);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства


&НаКлиенте
Процедура ПодборРеализации(Команда)
	
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Документ.РеализацияТоваров.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПеремещение(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("ОтборИсходящееПеремещение");
	ОткрытьФорму("Документ.ПеремещениеТоваров.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборРезервы(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	//ПараметрыФормы.Вставить("ОтборИсходящееПеремещение");
	ОткрытьФорму("Документ.РезервированиеЗаказовПокупателя.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборНалоговая(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Документ.ТК_НалоговаяНакладная.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборВыпускПродукции(Команда)
	
	ЗначениеОтбора = Новый Структура;
	ЗначениеОтбора.Вставить("ХозОперация", ПредопределенноеЗначение("Справочник.ХозОперации.ВыпускПродукцииСРеализацией"));	
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("Отбор", ЗначениеОтбора);
	
	ОткрытьФорму("Документ.ВыпускПродукции.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры



&НаКлиенте
Процедура ОтгрузитьВОднуНакладную(Команда)
	
	ОтгрузитьНаСервере("ВОдну");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузитьПоОтдельности(Команда)
	
	ОтгрузитьНаСервере("Раздельно");
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьРезервы(Команда)
	ПечатьВыделенного("Резервы");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОтгрузки(Команда)
	ПечатьВыделенного("Отгрузки");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОтгрузкиДвойная(Команда)
	ПечатьВыделенного("Отгрузки",Истина);
КонецПроцедуры

&НаСервере
Процедура ИсправитьНаСервере()
	
	
	НачатьТранзакцию();
	Попытка
		
		Для Каждого СтрДок Из Объект.Источники Цикл 
			
			Если  ЗначениеЗаполнено(СтрДок.Документ) И ТипЗнч(СтрДок.Документ) = Тип("ДокументСсылка.РезервированиеЗаказовПокупателя") Тогда
				
				
				ОбъектРезерв = СтрДок.Документ.ПолучитьОбъект();
				ОбъектРезерв.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				
				
				Если ЗначениеЗаполнено(СтрДок.Отгрузка) Тогда
					ОбъектОтгрузки =   СтрДок.Отгрузка.ПолучитьОбъект();
					ОбъектОтгрузки.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		
		Для Каждого СтрДок Из Объект.Источники Цикл 
			
			Если  ЗначениеЗаполнено(СтрДок.Документ) И ТипЗнч(СтрДок.Документ) = Тип("ДокументСсылка.РезервированиеЗаказовПокупателя") Тогда
				
				
				ОбъектРезерв = СтрДок.Документ.ПолучитьОбъект();
				ОбъектРезерв.Дата = ТекущаяДата();
				ОбъектРезерв.Заполнить(СтрДок.Документ.ДокументОснование);
				
				Документы.РезервированиеЗаказовПокупателя.УдалитьСтрокиБезОстатка(ОбъектРезерв);
				Документы.РезервированиеЗаказовПокупателя.ОбработатьКвотируемыеПозиции(ОбъектРезерв);
				Документы.РезервированиеЗаказовПокупателя.ЗаполнитьХарактеристикиПоОстаткамПартий(ОбъектРезерв);
				
				ОбъектРезерв.Записать(РежимЗаписиДокумента.Проведение);
				
			КонецЕсли;
			
		КонецЦикла;
		
		
		Для Каждого СтрДок Из Объект.Источники Цикл 
			
			Если  ЗначениеЗаполнено(СтрДок.Документ) И ТипЗнч(СтрДок.Документ) = Тип("ДокументСсылка.РезервированиеЗаказовПокупателя") Тогда
				
				
				Отгрузка = СтрДок.Отгрузка.ПолучитьОбъект();
				Отгрузка.Дата = ТекущаяДата();
				Отгрузка.Заполнить(СтрДок.Документ.ДокументОснование);
				
				Отгрузка.Записать(РежимЗаписиДокумента.Проведение);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	
	
	
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Исправить(Команда)
	ИсправитьНаСервере();
КонецПроцедуры




#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
    УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства


&НаСервере
Процедура ОбработкаРеквизитовТЧ(ТекСтрока)
	
	Документы.ТК_ТТН.ЗаполнитьРеквизитыТабличнойЧасти(Объект.Источники,ТекСтрока);
	
КонецПроцедуры

&НаСервере
Процедура ОтгрузитьНаСервере(РежимОтгрузки)
	
	ОтгрузкиСозданы = Ложь;
	
	Если РежимОтгрузки = "ВОдну" Тогда 
		Документы.ТК_ТТН.ИсточникиОтгрузитьВОднуНакладную(Объект.Ссылка, Объект.Источники, ОтгрузкиСозданы);
	ИначеЕсли РежимОтгрузки = "Раздельно" Тогда 
		Документы.ТК_ТТН.ИсточникиОтгрузитьРаздельно(Объект.Ссылка, Объект.Источники, ОтгрузкиСозданы);	
	КонецЕсли;
	
	Если ОтгрузкиСозданы Тогда 
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыТТН.Отгружен");
		УстановитьДоступностьЭлементов();
	КонецЕсли;		
	
	Попытка
		ЭтотОбъект.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Документ ''%1'' не удалось записать!
		|%2'; uk = 'Документ ''%1'' не вдалося записати!
		|%2'"),
		Строка(ЭтотОбъект),
		ОписаниеОшибки()));
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьВыделенного(ВидПечати,Двойная = Ложь)
	
	ВыделенныеДокументы = Элементы.Источники.ВыделенныеСтроки;
	
	ПараметрыПечати = Новый Структура("Строки, ВидПечати, Двойная", ВыделенныеДокументы, ВидПечати, Двойная);	
	
	Если ВыделенныеДокументы.Количество() = 1 Тогда 
		
		ПечатьВыделенногоПродолжение("МаршрутСигаретный", ПараметрыПечати);
		
	ИначеЕсли ВыделенныеДокументы.Количество() > 1 Тогда 
		
		СписокВариантов = Новый СписокЗначений;
		СписокВариантов.Добавить("МаршрутСигаретный", НСтр("ru = 'Маршрут Сигаретный'; uk = 'Маршрут Сигаретний'"));
		СписокВариантов.Добавить("МаршрутПивной", НСтр("ru = 'Маршрут Пивной'; uk = 'Маршрут Пивний'"));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПечатьВыделенногоПродолжение", ЭтаФорма, ПараметрыПечати);
		
		ПоказатьВопрос(
		ОписаниеОповещения,
		НСтр("ru = 'Выберите порядок сортировки документов'; uk = 'Оберіть порядок сортування документів'"),
		СписокВариантов,
		,
		СписокВариантов[0].Значение,
		НСтр("ru = 'Сортировка документов'; uk = 'Сортування документів'"));				
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьВыделенногоПродолжение(Порядок, ДопПараметры) Экспорт 
	
	Перем СписокСтрок, ВидПечати, ИдентификаторыПечатныхФорм;
	
	СписокСтрок = ДопПараметры.Строки;
	ВидПечати = ДопПараметры.ВидПечати;
	Двойная = ДопПараметры.Двойная;
	ПараметрыПечати = Новый Структура;
	
	Если ПросмотрПечати И ЗначениеЗаполнено(ДатаПечати) Тогда 
		ПараметрыПечати.Вставить("ДатаПечати", ДатаПечати);
	КонецЕсли;
	
	Если Порядок = Неопределено Тогда 
		Возврат;
	ИначеЕсли Порядок = "МаршрутСигаретный" Тогда 
		ПараметрыПечати.Вставить("Порядок", "Сигареты");
	ИначеЕсли Порядок = "МаршрутПивной" Тогда 
		ПараметрыПечати.Вставить("Порядок", "Пиво");
	КонецЕсли;
	
	СоответствиеТиповПечати = Новый Соответствие;		
	
	Если ВидПечати = "Отгрузки" Тогда 					
		
		СтруктураПечатиРеализация = Новый Структура;
		СтруктураПечатиРеализация.Вставить("ИмяМенеджерПечати", "Документ.РеализацияТоваров");
		СтруктураПечатиРеализация.Вставить("ИменаМакетов", "РасходнаяНакладнаяДвойнаяУКТВЭД");
		СтруктураПечатиРеализация.Вставить("МассивОбъектов", Новый Массив);
		
		СоответствиеТиповПечати.Вставить(Тип("ДокументСсылка.РеализацияТоваров"), СтруктураПечатиРеализация);
		
		СтруктураПечатиПеремещение = Новый Структура;
		СтруктураПечатиПеремещение.Вставить("ИмяМенеджерПечати", "Документ.ПеремещениеТоваров");
		СтруктураПечатиПеремещение.Вставить("ИменаМакетов", ?(Двойная,"ПеремещениеТоваровДвойная","ПеремещениеТоваров"));
		СтруктураПечатиПеремещение.Вставить("МассивОбъектов", Новый Массив);
		
		СоответствиеТиповПечати.Вставить(Тип("ДокументСсылка.ПеремещениеТоваров"), СтруктураПечатиПеремещение);
		
		
	ИначеЕсли ВидПечати = "Резервы" Тогда 
		
		СтруктураРезервы = Новый Структура;
		СтруктураРезервы.Вставить("ИмяМенеджерПечати", "Документ.РезервированиеЗаказовПокупателя");
		СтруктураРезервы.Вставить("ИменаМакетов", "РезервированиеЗаказовПоМаршруту");
		СтруктураРезервы.Вставить("МассивОбъектов", Новый Массив);
		
		СоответствиеТиповПечати.Вставить(Тип("ДокументСсылка.РезервированиеЗаказовПокупателя"), СтруктураРезервы);
	Иначе
		Возврат;
	КонецЕсли;
	
	ДокументыПечати = Новый СписокЗначений;
	
	Для Каждого идСтр Из СписокСтрок Цикл 	
		текСтрока = Объект.Источники.Получить(идСтр);
		текДок = Неопределено;
		ОдинДокОтгрузки = Истина;
		
		Если ВидПечати = "Отгрузки" Тогда 
			текДок = текСтрока.Отгрузка;
		ИначеЕсли ВидПечати = "Резервы" Тогда 
			текДок = текСтрока.Документ;
		КонецЕсли;
		
		ТипДокумента = ТипЗнч(текДок);
		
		Если ТипДокумента = Тип("ДокументСсылка.РезервированиеЗаказовПокупателя") Тогда
			ДокументыОтгрузки = ПолучитьДокументыОтгрузки(текДок);
			Если ДокументыОтгрузки.Количество()<>0 Тогда 
				ОдинДокОтгрузки = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		СтруктураПараметров = СоответствиеТиповПечати.Получить(ТипДокумента);
		Если СтруктураПараметров <> Неопределено И ОдинДокОтгрузки Тогда 
			СтруктураПараметров.МассивОбъектов.Добавить(текДок);
		Иначе
			Для Каждого Док Из ДокументыОтгрузки Цикл
				СтруктураПараметров.МассивОбъектов.Добавить(Док);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого стрПараметрыПечати Из СоответствиеТиповПечати Цикл 
		текПараметры = стрПараметрыПечати.Значение;
		Если текПараметры.МассивОбъектов.Количество() > 0 Тогда 
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(текПараметры.ИмяМенеджерПечати, текПараметры.ИменаМакетов, текПараметры.МассивОбъектов, ЭтаФорма, ПараметрыПечати);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДокументыОтгрузки(Документ)
	
	МассивДокументов = Новый Массив;
	
	Если Документ.РаспределениеОтгрузки.Количество()> 1 Тогда
		МассивЗаказов = Документ.РаспределениеОтгрузки.выгрузить();
	Иначе
		Возврат МассивДокументов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПеремещениеТоваров.Ссылка КАК Документ
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.ДокументОснование В (&МассивЗаказов)
		|	И ПеремещениеТоваров.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваров.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваров КАК РеализацияТоваров
		|ГДЕ
		|	РеализацияТоваров.ДокументОснование В(&МассивЗаказов)
		|	И РеализацияТоваров.Проведен";
	
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивДокументов.Добавить(ВыборкаДетальныеЗаписи.Документ);	
	КонецЦикла;
	
	Возврат МассивДокументов
	
КонецФункции

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияТК.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПоДате(Команда)
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.ТК_ТТН", "МаршрутныйЛист,ТТН_Аттика", Объект.Ссылка, ЭтаФорма, Новый Структура("ДатаПечати", ДатаПечати));
КонецПроцедуры

#КонецОбласти


#Область УправлениеЭлементамиФормы

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	МассивДоступныхРеквизитов = Новый Массив;
	МассивНедоступныхРеквизитов = Новый Массив;
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыТТН.КИсполнению") Тогда 
		
		МассивНедоступныхРеквизитов.Добавить("Перевозчик");
		МассивНедоступныхРеквизитов.Добавить("Автомобиль");
		МассивНедоступныхРеквизитов.Добавить("Прицеп");
		МассивНедоступныхРеквизитов.Добавить("Водитель");
		МассивНедоступныхРеквизитов.Добавить("Экспедитор");
		МассивНедоступныхРеквизитов.Добавить("Основание");
		МассивНедоступныхРеквизитов.Добавить("НомерПЛ");
		МассивНедоступныхРеквизитов.Добавить("Отправитель");
		МассивНедоступныхРеквизитов.Добавить("ПунктОтправитель"); 
		МассивНедоступныхРеквизитов.Добавить("Заказчик");
		МассивНедоступныхРеквизитов.Добавить("ПунктПолучатель");
		МассивНедоступныхРеквизитов.Добавить("Заказчик");
		МассивНедоступныхРеквизитов.Добавить("Пломба");
		МассивНедоступныхРеквизитов.Добавить("ВидПеревозки");
		МассивНедоступныхРеквизитов.Добавить("Организация");
		МассивНедоступныхРеквизитов.Добавить("ПодразделениеКомпании");
		МассивНедоступныхРеквизитов.Добавить("НомерПрав");
		МассивНедоступныхРеквизитов.Добавить("Контрагент");
		
		МассивДоступныхРеквизитов.Добавить("Источники");
		МассивДоступныхРеквизитов.Добавить("ИсточникиГруппаОтгрузить");		
		
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыТТН.Отгружен") Тогда 
		
		МассивНедоступныхРеквизитов.Добавить("Перевозчик");
		МассивНедоступныхРеквизитов.Добавить("Автомобиль");
		МассивНедоступныхРеквизитов.Добавить("Прицеп");
		МассивНедоступныхРеквизитов.Добавить("Водитель");
		МассивНедоступныхРеквизитов.Добавить("Экспедитор");
		МассивНедоступныхРеквизитов.Добавить("Основание");
		МассивНедоступныхРеквизитов.Добавить("НомерПЛ");
		МассивНедоступныхРеквизитов.Добавить("Отправитель");
		МассивНедоступныхРеквизитов.Добавить("ПунктОтправитель"); 
		МассивНедоступныхРеквизитов.Добавить("Заказчик");
		МассивНедоступныхРеквизитов.Добавить("ПунктПолучатель");
		МассивНедоступныхРеквизитов.Добавить("Заказчик");
		МассивНедоступныхРеквизитов.Добавить("Пломба");
		МассивНедоступныхРеквизитов.Добавить("ВидПеревозки");
		МассивНедоступныхРеквизитов.Добавить("НомерПрав");
		МассивНедоступныхРеквизитов.Добавить("Контрагент");
		МассивНедоступныхРеквизитов.Добавить("Организация");
		МассивНедоступныхРеквизитов.Добавить("ПодразделениеКомпании");
		МассивНедоступныхРеквизитов.Добавить("Источники");
		МассивНедоступныхРеквизитов.Добавить("ИсточникиГруппаОтгрузить");
		
	Иначе
		
		МассивДоступныхРеквизитов.Добавить("Перевозчик");
		МассивДоступныхРеквизитов.Добавить("Автомобиль");
		МассивДоступныхРеквизитов.Добавить("Прицеп");
		МассивДоступныхРеквизитов.Добавить("Водитель");
		МассивДоступныхРеквизитов.Добавить("Экспедитор");
		МассивДоступныхРеквизитов.Добавить("Основание");
		МассивДоступныхРеквизитов.Добавить("НомерПЛ");
		МассивДоступныхРеквизитов.Добавить("Отправитель");
		МассивДоступныхРеквизитов.Добавить("ПунктОтправитель"); 
		МассивДоступныхРеквизитов.Добавить("Заказчик");
		МассивДоступныхРеквизитов.Добавить("ПунктПолучатель");
		МассивДоступныхРеквизитов.Добавить("Заказчик");
		МассивДоступныхРеквизитов.Добавить("Пломба");
		МассивДоступныхРеквизитов.Добавить("ВидПеревозки");
		МассивДоступныхРеквизитов.Добавить("Контрагент");
		МассивДоступныхРеквизитов.Добавить("НомерПрав");
		МассивДоступныхРеквизитов.Добавить("Организация");
		МассивДоступныхРеквизитов.Добавить("ПодразделениеКомпании");
		МассивДоступныхРеквизитов.Добавить("Источники");
		МассивДоступныхРеквизитов.Добавить("ИсточникиГруппаОтгрузить");
		
	КонецЕсли;
	
	//Данные логистики
	Если Объект.ЕстьДанныеЛогистики Тогда 
		МассивДоступныхРеквизитов.Добавить("ГруппаЛогистика");
	Иначе
		МассивНедоступныхРеквизитов.Добавить("ГруппаЛогистика");
	КонецЕсли;
	
	
	Если МассивНедоступныхРеквизитов.Количество() > 0 Тогда 
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивНедоступныхРеквизитов, "Доступность", Ложь, Истина);
	КонецЕсли;
	
	Если МассивДоступныхРеквизитов.Количество() > 0 Тогда 
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивДоступныхРеквизитов, "Доступность", Истина, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтгрузкиНаСервере()
	
	МассивРезервов = Объект.Источники.Выгрузить(, "Документ");
	ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивРезервов);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РезервированиеЗаказовПокупателя.Ссылка КАК Резерв,
	               |	РезервированиеЗаказовПокупателя.ДокументОснование КАК ЗаказПокупателя
	               |ПОМЕСТИТЬ Вт
	               |ИЗ
	               |	Документ.РезервированиеЗаказовПокупателя КАК РезервированиеЗаказовПокупателя
	               |ГДЕ
	               |	РезервированиеЗаказовПокупателя.Ссылка В(&МассивРезервов)
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	РезервированиеЗаказовПокупателяРаспределениеОтгрузки.Ссылка,
	               |	РезервированиеЗаказовПокупателяРаспределениеОтгрузки.ЗаказПокупателя
	               |ИЗ
	               |	Документ.РезервированиеЗаказовПокупателя.РаспределениеОтгрузки КАК РезервированиеЗаказовПокупателяРаспределениеОтгрузки
	               |ГДЕ
	               |	РезервированиеЗаказовПокупателяРаспределениеОтгрузки.Ссылка В(&МассивРезервов)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Вт.Резерв КАК Резерв,
	               |	Вт.ЗаказПокупателя КАК ЗаказПокупателя,
	               |	ПеремещениеТоваров.Ссылка КАК Отгрузка,
	               |	ВЫБОР
	               |		КОГДА ПеремещениеТоваров.Проведен
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК Порядок
	               |ПОМЕСТИТЬ Вт_Отгрузки
	               |ИЗ
	               |	Вт КАК Вт
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	               |		ПО Вт.ЗаказПокупателя = ПеремещениеТоваров.ДокументОснование
	               |			И (ПеремещениеТоваров.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя)
	               |			И (НЕ ПеремещениеТоваров.ПометкаУдаления)
	               |ГДЕ
	               |	ПеремещениеТоваров.Организация = &Организация
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Вт.Резерв,
	               |	Вт.ЗаказПокупателя,
	               |	РеализацияТоваров.Ссылка,
	               |	ВЫБОР
	               |		КОГДА РеализацияТоваров.Проведен
	               |			ТОГДА 10
	               |		ИНАЧЕ 20
	               |	КОНЕЦ
	               |ИЗ
	               |	Вт КАК Вт
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров КАК РеализацияТоваров
	               |		ПО Вт.ЗаказПокупателя = РеализацияТоваров.ДокументОснование
	               |			И (РеализацияТоваров.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя)
	               |			И (НЕ РеализацияТоваров.ПометкаУдаления)
	               |ГДЕ
	               |	РеализацияТоваров.Организация = &Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Вт_Отгрузки.Резерв КАК Резерв,
	               |	Вт_Отгрузки.ЗаказПокупателя КАК ЗаказПокупателя,
	               |	Вт_Отгрузки.Отгрузка КАК Отгрузка,
	               |	ВЫБОР
	               |		КОГДА Вт_Отгрузки.Отгрузка.Ссылка ССЫЛКА Документ.ПеремещениеТоваров
	               |			ТОГДА ВЫРАЗИТЬ(Вт_Отгрузки.Отгрузка КАК Документ.ПеремещениеТоваров).Автор
	               |		КОГДА Вт_Отгрузки.Отгрузка.Ссылка ССЫЛКА Документ.РеализацияТоваров
	               |			ТОГДА ВЫРАЗИТЬ(Вт_Отгрузки.Отгрузка КАК Документ.РеализацияТоваров).Автор
	               |	КОНЕЦ КАК Автор,
	               |	ВЫБОР
	               |		КОГДА Вт_Отгрузки.Отгрузка.Ссылка ССЫЛКА Документ.ПеремещениеТоваров
	               |			ТОГДА ВЫРАЗИТЬ(Вт_Отгрузки.Отгрузка КАК Документ.ПеремещениеТоваров).Организация
	               |		КОГДА Вт_Отгрузки.Отгрузка.Ссылка ССЫЛКА Документ.РеализацияТоваров
	               |			ТОГДА ВЫРАЗИТЬ(Вт_Отгрузки.Отгрузка КАК Документ.РеализацияТоваров).Организация
	               |	КОНЕЦ КАК Организация
	               |ИЗ
	               |	Вт_Отгрузки КАК Вт_Отгрузки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Отгрузка
	               |ИТОГИ
	               |	МАКСИМУМ(ЗаказПокупателя)
	               |ПО
	               |	Резерв";
	
	Запрос.УстановитьПараметр("МассивРезервов", МассивРезервов);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл 
		МассивСтрок = Объект.Источники.НайтиСтроки(Новый Структура("Документ", Выборка.Резерв));
		Если МассивСтрок.Количество() > 0 Тогда
			ТекСтрока = МассивСтрок[0];
		Иначе
			Продолжить;
		КонецЕсли;
		
		ВыборкаОтгрузка = Выборка.Выбрать();
		Если ВыборкаОтгрузка.Количество() = 0 Тогда 
			Продолжить;
		ИначеЕсли ВыборкаОтгрузка.Количество() > 1 Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'По ререзву %1 найдено %2 отгрузок'; uk = 'По резерву %1 знайдено %2 відвантажень'"),
			Выборка.Резерв, 
			ВыборкаОтгрузка.Количество()));
		КонецЕсли;
		
		ВыборкаОтгрузка.Следующий();
		ТекСтрока.Автор = ВыборкаОтгрузка.Автор;
		ТекСтрока.Отгрузка = ВыборкаОтгрузка.Отгрузка;
		ТекСтрока.СтатусОтгрузки = 	Документы.ТК_ТТН.ПолучитьСтатусОтгрузки(ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсеОтгрузкиНаСервере()
	
	МассивРезервов = Объект.Источники.Выгрузить(, "Документ");
	ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивРезервов);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РезервированиеЗаказовПокупателя.Ссылка КАК Резерв,
	               |	РезервированиеЗаказовПокупателя.ДокументОснование КАК ЗаказПокупателя
	               |ПОМЕСТИТЬ Вт
	               |ИЗ
	               |	Документ.РезервированиеЗаказовПокупателя КАК РезервированиеЗаказовПокупателя
	               |ГДЕ
	               |	РезервированиеЗаказовПокупателя.Ссылка В(&МассивРезервов)
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	РезервированиеЗаказовПокупателяРаспределениеОтгрузки.Ссылка,
	               |	РезервированиеЗаказовПокупателяРаспределениеОтгрузки.ЗаказПокупателя
	               |ИЗ
	               |	Документ.РезервированиеЗаказовПокупателя.РаспределениеОтгрузки КАК РезервированиеЗаказовПокупателяРаспределениеОтгрузки
	               |ГДЕ
	               |	РезервированиеЗаказовПокупателяРаспределениеОтгрузки.Ссылка В(&МассивРезервов)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Вт.Резерв КАК Резерв,
	               |	Вт.ЗаказПокупателя КАК ЗаказПокупателя,
	               |	ПеремещениеТоваров.Ссылка КАК Отгрузка,
	               |	ВЫБОР
	               |		КОГДА ПеремещениеТоваров.Проведен
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК Порядок
	               |ПОМЕСТИТЬ Вт_Отгрузки
	               |ИЗ
	               |	Вт КАК Вт
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	               |		ПО Вт.ЗаказПокупателя = ПеремещениеТоваров.ДокументОснование
	               |			И (ПеремещениеТоваров.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя)
	               |			И (НЕ ПеремещениеТоваров.ПометкаУдаления)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Вт.Резерв,
	               |	Вт.ЗаказПокупателя,
	               |	РеализацияТоваров.Ссылка,
	               |	ВЫБОР
	               |		КОГДА РеализацияТоваров.Проведен
	               |			ТОГДА 10
	               |		ИНАЧЕ 20
	               |	КОНЕЦ
	               |ИЗ
	               |	Вт КАК Вт
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров КАК РеализацияТоваров
	               |		ПО Вт.ЗаказПокупателя = РеализацияТоваров.ДокументОснование
	               |			И (РеализацияТоваров.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя)
	               |			И (НЕ РеализацияТоваров.ПометкаУдаления)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Вт_Отгрузки.Резерв КАК Резерв,
	               |	Вт_Отгрузки.ЗаказПокупателя КАК ЗаказПокупателя,
	               |	Вт_Отгрузки.Отгрузка КАК Отгрузка,
	               |	ВЫБОР
	               |		КОГДА Вт_Отгрузки.Отгрузка.Ссылка ССЫЛКА Документ.ПеремещениеТоваров
	               |			ТОГДА ВЫРАЗИТЬ(Вт_Отгрузки.Отгрузка КАК Документ.ПеремещениеТоваров).Автор
	               |		КОГДА Вт_Отгрузки.Отгрузка.Ссылка ССЫЛКА Документ.РеализацияТоваров
	               |			ТОГДА ВЫРАЗИТЬ(Вт_Отгрузки.Отгрузка КАК Документ.РеализацияТоваров).Автор
	               |	КОНЕЦ КАК Автор,
	               |	ВЫБОР
	               |		КОГДА Вт_Отгрузки.Отгрузка.Ссылка ССЫЛКА Документ.ПеремещениеТоваров
	               |			ТОГДА ВЫРАЗИТЬ(Вт_Отгрузки.Отгрузка КАК Документ.ПеремещениеТоваров).Организация
	               |		КОГДА Вт_Отгрузки.Отгрузка.Ссылка ССЫЛКА Документ.РеализацияТоваров
	               |			ТОГДА ВЫРАЗИТЬ(Вт_Отгрузки.Отгрузка КАК Документ.РеализацияТоваров).Организация
	               |	КОНЕЦ КАК Организация
	               |ИЗ
	               |	Вт_Отгрузки КАК Вт_Отгрузки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Отгрузка
	               |ИТОГИ
	               |	МАКСИМУМ(ЗаказПокупателя)
	               |ПО
	               |	Резерв";
	
	Запрос.УстановитьПараметр("МассивРезервов", МассивРезервов);
	//Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл 
		МассивСтрок = Объект.Источники.НайтиСтроки(Новый Структура("Документ", Выборка.Резерв));
		Если МассивСтрок.Количество() > 0 Тогда
			ТекСтрока = МассивСтрок[0];
		Иначе
			Продолжить;
		КонецЕсли;
		
		ВыборкаОтгрузка = Выборка.Выбрать();
		Если ВыборкаОтгрузка.Количество() = 0 Тогда 
			Продолжить;
		ИначеЕсли ВыборкаОтгрузка.Количество() > 1 Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'По ререзву %1 найдено %2 отгрузок'; uk = 'По резерву %1 знайдено %2 відвантажень'"),
			Выборка.Резерв, 
			ВыборкаОтгрузка.Количество()));
		КонецЕсли;
		
		ВыборкаОтгрузка.Следующий();
		ТекСтрока.Автор = ВыборкаОтгрузка.Автор;
		ТекСтрока.Отгрузка = ВыборкаОтгрузка.Отгрузка;
		ТекСтрока.СтатусОтгрузки = 	Документы.ТК_ТТН.ПолучитьСтатусОтгрузки(ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтгрузки(Команда)
	ЗаполнитьОтгрузкиНаСервере();
КонецПроцедуры

&НаСервере
Функция ЗапросНайтиПодчиненныйПоТипу(Знач ДокСсылка,Знач ТипДокумента)
	Запрос = Новый Запрос;
	Запрос.Текст =     "ВЫБРАТЬ
	|	СвязанныеДокументы.Ссылка КАК ДокСсылка,
	|	ВЫБОР
	|		КОГДА СвязанныеДокументы.Ссылка ССЫЛКА Документ."+ТипДокумента+"
	|			ТОГДА ВЫРАЗИТЬ(СвязанныеДокументы.Ссылка КАК Документ."+ТипДокумента+").ПометкаУдаления
	|	КОНЕЦ КАК ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА СвязанныеДокументы.Ссылка ССЫЛКА Документ."+ТипДокумента+"
	|			ТОГДА ВЫРАЗИТЬ(СвязанныеДокументы.Ссылка КАК Документ."+ТипДокумента+").Проведен
	|	КОНЕЦ КАК Проведен
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&Док) КАК СвязанныеДокументы
	|ГДЕ
	|	СвязанныеДокументы.Ссылка ССЫЛКА Документ."+ТипДокумента+"";
	Запрос.УстановитьПараметр("Док",ДокСсылка);
	
	Возврат Запрос;
	
КонецФункции

&НаКлиенте
Процедура ПросмотрПечатиПриИзменении(Элемент)
	Элементы.ФормаДокументТК_ТТНПакетДокументов.Видимость = ПросмотрПечати;
	Элементы.ФормаДокументТК_ТТНПакетДокументовНаПринтер.Видимость = НЕ ПросмотрПечати;
	Элементы.ГруппаДатаПечати.Видимость = ПросмотрПечати;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоМаршруту(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ОповещениЕ = Новый ОписаниеОповещения("ЗаполнитьПослеВыбора", ЭтотОбъект, Команда.Имя);
	
	ОткрытьФорму("Документ.ТК_ТТН.Форма.Форма",ПараметрыФормы,ЭтаФорма,,,,ОповещениЕ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПослеВыбора(Результат,ДопПараметры) Экспорт
	
	Если Результат <> Неопределено и ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ОбработатьВыбранноеЗначение(Результат.Документы);
		
		ЗаполнитьОтгрузкиНаСервере();
		
		Для Каждого Стр Из Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю("Для документа "+ стр+" есть документ Корректировка Заказа!!!");
		КонецЦикла;
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нет документов для загрузки!!!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтгрузить(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ОповещениЕ = Новый ОписаниеОповещения("ВыполнитьПослеВыбора", ЭтотОбъект, Команда.Имя);
	
	ОткрытьФорму("Документ.ТК_ТТН.Форма.Форма",ПараметрыФормы,ЭтаФорма,,,,ОповещениЕ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьПослеВыбора(Результат,ДопПараметры) Экспорт
	
	Если Результат <> Неопределено и ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ОбработатьВыбранноеЗначение(Результат.Документы);
		
		ЗаполнитьВсеОтгрузкиНаСервере();
		
		Для Каждого Стр Из Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю("Для документа "+ стр+" есть документ Корректировка Заказа!!!");
		КонецЦикла;
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нет документов для загрузки!!!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	Объект.Источники.Очистить();
КонецПроцедуры


#КонецОбласти
